/********************************************************************************************************************
 *   CsPrivateStruct.h
 *   Common private structures for CompuScope driver
 *
 *
 *   Version 1.0
 ********************************************************************************************************************/
#ifndef _CS_PRIVATE_STRUCT_H_
#define _CS_PRIVATE_STRUCT_H_

#include "CsTypes.h"
#include "CsStruct.h"

#ifdef _WIN32
#pragma once
#endif

#define MAX_IMAGE_COUNT 3

#define CS_RM_INACTIVE 0x0
#define CS_RM_ACTIVE32 0x1
#define CS_RM_ACTIVE64 0x2
#define CS_RM_ACTIVE_REMOTE 0x4  // System is a remote system being used by someone other than us

#ifdef CS_WIN64
	#define CS_RM_ACTIVE CS_RM_ACTIVE64
#else
	#define CS_RM_ACTIVE CS_RM_ACTIVE32
#endif

#define CS_FIRMWARE_OPTION_TYPE 1
#define CS_HARDWARE_OPTION_TYPE 2

#define FS_BASE_HANDLE		0x00010000
#define RM_BASE_HANDLE		0x00020000
#define RM_DEMO_HANDLE		0x00040000
#define RM_REMOTE_HANDLE	0x00080000


// Aux IO Dialog types for CompuScope Manager
#define AUX_IO_SIMPLE_DLG	0x0001	// simple dialog for Splenda and Spider boards
#define AUX_IO_COBRA_DLG	0x0002	// slightly more complex for Cobra and Cobra Max
#define AUX_IO_JD_DLG		0x0003	// still more complex for John Deere boards


// Macro for naming events in debug mode so they can be debugged with Soft Ice.
#ifdef DEBUG
#define HANDLE_NAME(x) _T("__Cs" x)
#else
#define HANDLE_NAME(x) NULL
#endif

//! EEPROM Read operation

#define CS_TRIG_OUT				    70

//! Splenda Gain Tartget factor
#define CS_GAINTARGET_FACTOR		71

//! Splenda Front Port Reistance
#define CS_FRONTPORT_RESISTANCE		72

//! JohnDeere diagnostic test of ADC data alignment
#define	CS_CHECK_ADC_DATA_ALIGN		73

//! Send Nios command
#define	CS_SEND_NIOS_CMD			74

//! Auxillary input config
#define CS_AUX_IN				    75

//! Auxillary output config
#define CS_AUX_OUT				    76

//! Read PCIe Link info
#define CS_READ_PCIeLINK_INFO	    77

//! Read Gage register
#define	CS_READ_GAGE_REGISTER		78

//! Reset the histogram counters
#define	CS_HISTOGRAM_RESET			79

//! Write Gage register
#define	CS_WRITE_GAGE_REGISTER		80

//! Query for the current boot location (-1=Safe boot, 0=Reg, 1=Expert1, 2=Expert2)
#define	CS_CURRENT_BOOT_LOCATION	81

//! Get/Set the next boot location (0=Reg, 1=Expert1, 2=Expert2)
#define	CS_NEXT_BOOT_LOCATION		82

//! Get the current firmware version of Baseboard and Addon board
#define	CS_CURRENT_FW_VERSION		83

//! Query for the flash sector size
#define	CS_FLASH_SECTOR_SIZE	84

//!Read PCI register
#define CS_READ_PCI_REGISTER	85

//!Write PCI register
#define CS_WRITE_PCI_REGISTER	86

//!For Debug:  Flash operation READ Value
#define CS_FLASH_OP_READ_VAL	87

//!For Debug:  Flash operation WRITE Value
#define CS_FLASH_OP_WRITE_VAL	88

//!For Debug: Write a buffer to flash
#define CS_FLASH_PROG_BUFFER	89



//   CAPS_ID   used in CsGetSystemCaps() to identify the
//   dynamic configuration requested
//
//
//	CAPS_ID  =   MainCapsId | SubCapsId
//
//  -------------------------------------------------
//  |	MainCapsId		 |		0000				|
//  -------------------------------------------------
//  31                15  14                       0
//
//  ------------------------------------------------
//  |   0000		     |      SubCapsId	       |
//  ------------------------------------------------
//  31                15  14                       0

//  Depending on CapsID, SubCapsId has different meaning
//  When call CsDrvGetSyatemCaps(),
//  CapsID and SunCapsID should always be ORed together
//
#define	CAPS_ID_MASK		0xFFFF0000
#define SUBCAPS_ID_MASK     0x0000FFFF

//  Value used in CS_SELF_TEST_MODE
#define	CSST_DISABLE				0
#define	CSST_CAPTURE_DATA			1
#define	CSST_BIST					2
#define	CSST_COUNTER_DATA			3
#define	CSST_MISC					4

#define CSMV_111_MHz_NIOS_CLK   0x40000000


typedef enum
{
	ecmCalModeNormal = 0,
	ecmCalModeDc  = ecmCalModeNormal + 1,
	ecmCalModeAc = ecmCalModeDc + 1,
	ecmCalModePci = ecmCalModeAc + 1,
	ecmCalModeMs = ecmCalModePci + 1,
	ecmCalModeExtTrig = ecmCalModeMs + 1,
	ecmCalModeExtTrigChan = ecmCalModeExtTrig + 1,
	ecmCalModeAdc = ecmCalModeExtTrigChan + 1,
	ecmCalModeTAO = ecmCalModeAdc + 1,
	ecmCalModeDual = ecmCalModeTAO + 1,
}eCalMode;


#ifdef _WIN32
#pragma pack (8)
#endif

//!
//! \defgroup PRIVATE_STRUCTURES
//! \{
//!

//! \struct _CSSYSTEMCAPS
//! \brief Structure to represent the static information for each system.
//! The fields in this structure cannot be modified.
typedef struct _CSSYSTEMCAPS
{
	uInt32	u32Size;   					//!< Total size, in bytes, of the structure.
	int64 	i64MemorySize;				//!< Memory size of the board(s).
	uInt32 	u32ModesAvailable;			//!< Which operating modes are available (ie. dual, single).
	cschar	lpBoardName[32];			//!< String representing the board name.
	uInt32	u32MultipleRecordAvailable;	//!< Is multiple record available.
	uInt32	u32ExternalClockAvailable;	//!< Is external clock available.
	uInt32	u32DiffInputAvailable;		//!< Is differential input available.
	int64	i64MaximumSampleRate;		//!< What's the max sample rate for this system.
	uInt32	u32Filter;					//!< The maximum bandwidth in KHz.
	int32	i32ImpedanceAvailable;		//!< Which impedances are available.
	int32	i32NumberOfTriggers;		//!< How many triggers are available in the system.
	int32	i32TriggerType;				//!< What type of trigger(s) is (are) available.
	int32	i32DigitalChannelsAvailable; //!< How many digital channels are available (Combine).
} CSSYSTEMCAPS, *PCSSYSTEMCAPS;


typedef struct _VALID_AUX_CONFIG
{
	char	Str[128];
	uInt32	u32Ctrl;
} VALID_AUX_CONFIG, *PVALID_AUX_CONFIG;


//! \struct _CSSYSTEMCAPS
//! \brief Structure to represent the static information for each system.
//! The fields in this structure cannot be modified.
typedef struct __CAPS_AUX_CONFIG
{
	uInt32	u32Size;   					//!< Total size, in bytes, of the structure.
	uInt8	u8DlgType;					//!< Aux Cfg Dlg type 1, 2, 3, or 4
	BOOL	bClockOut;					//!< Clock out supported
	BOOL	bTrigOut;					//!< Trig out supported
	BOOL	bTrigOut_IN;				//!< Trig out as Input supported
	BOOL	bAuxIN;						//!< Aux input supported
	BOOL	bAuxOUT;					//!< Aux out supported

} CS_CAPS_AUX_CONFIG, *PCS_CAPS_AUX_CONFIG;


/*************************************************************/

//! \struct _CS_CHANNEL_CAPS
//! \brief Structure used by HW Dlls and Kernel Drivers for channel BM transfer capability
//!
typedef struct  _CS_CHANNEL_CAPS
{
	uInt32		u32ChannelIndex;
	BOOLEAN		bBusMasterSupport;
} CS_CHANNEL_CAPS, *PCS_CHANNEL_CAPS;


typedef struct  _CS_DYNAMIC_SYSTEMCAPS
{
	uInt32				ChannelCount;
	CS_CHANNEL_CAPS		ChannelCap[1];
} CS_DYNAMIC_SYSTEMCAPS, *PCS_DYNAMIC_SYSTEMCAPS;


//! \struct _CSDATATRANSFERRESULT
//! \brief  structure used in CsGetAsyncTransferDataResult
//!
typedef struct _CSTRANSFERDATARESULT
{
	int32		i32Status;				//<! Status of data transfer
	int64		i64BytesTransfered;		//<! Bytes transfered to buffer
} CSTRANSFERDATARESULT, *PCSTRANSFERDATARESULT;
/*************************************************************/
//!
//! \}
//!

//----------------------------------------------------------

typedef struct
{
	char	signature[4];		//	NOT null terminated.
	uInt16	size;				//	Size of EEPROM in BITS.
	uInt16	board_type;			//	Encoded board types from GAGE_DRV.H.
	uInt16	version;			//	BCD, XX.XX.
	uInt16	memory_size;		//	Decimal (in kilobytes).
	uInt32	serial_number;		//	BCD, right-justified w/leading zeros.
	uInt32	options;			//	BIT encoded (see EEPROM_OPTIONS_XXXXXXXX).
	uInt16	a_ranges[7];		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets[7];		//	Default calibration values (all bits set if not supported).
	uInt16	power_on_value;		//	Time in 0.1 mSecs for power on delay.
	uInt16	hw_ati_version;		//	BCD, XX.XX.
	uInt16	hw_mem_version;		//	BCD, XX.XX.
	uInt16	hw_ets_version;		//	BCD, XX.XX.
	uInt16	ets_offset;			//	Decimal.
	uInt16	ets_correct;		//	Decimal.
	uInt16	ets_trigger_offset;	//	Decimal.
	uInt8	trig_level_off[2];	//	Decimal.
	uInt8	trig_level_scale[2];//	Decimal.
	uInt16	trig_addr_off[4];	//	uInt4, 16 values in 4 words (layed out linearly -> 0,1,2,3 4,5,6,7 8,9,10,11 12,13,14,15) or
								//	uInt8,  8 values in 4 words (layed out linearly -> 0,1 2,3 4,5 6,7).
	uInt16	a_ranges_50;		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets_50;		//	Default calibration values (all bits set if not supported).
	uInt16	padding[8];			//	Zero filled.

	uInt16	check_sum;			//	Check sum of entire EEPROM except these two bytes.  (location is dependant on EEPROM size).

#ifdef __linux__
}__attribute__ ((packed)) eepromtype1024;
#else

}eepromtype1024;
#endif

//----------------------------------------------------------

typedef struct
{

	char	signature[4];		//	NOT null terminated.
	uInt16	size;				//	Size of EEPROM in BITS.
	uInt16	board_type;			//	Encoded board types from GAGE_DRV.H.
	uInt16	version;			//	BCD, XX.XX.
	uInt16	memory_size;		//	Decimal (in kilobytes).
	uInt32	serial_number;		//	BCD, right-justified w/leading zeros.
	uInt32	options;			//	BIT encoded (see EEPROM_OPTIONS_XXXXXXXX).
	uInt16	a_ranges[7];		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets[7];		//	Default calibration values (all bits set if not supported).
	uInt16	power_on_value;		//	Time in 0.1 mSecs for power on delay.
	uInt16	hw_ati_version;		//	BCD, XX.XX.
	uInt16	hw_mem_version;		//	BCD, XX.XX.
	uInt16	hw_ets_version;		//	BCD, XX.XX.
	uInt16	ets_offset;			//	Decimal.
	uInt16	ets_correct;		//	Decimal.
	uInt16	ets_trigger_offset;	//	Decimal.
	uInt8	trig_level_off[2];	//	Decimal.
	uInt8	trig_level_scale[2];//	Decimal.
	uInt16	trig_addr_off[4];	//	uInt4, 16 values in 4 words (layed out linearly -> 0,1,2,3 4,5,6,7 8,9,10,11 12,13,14,15) or
								//	uInt8,  8 values in 4 words (layed out linearly -> 0,1 2,3 4,5 6,7).
	uInt16	a_ranges_50;		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets_50;		//	Default calibration values (all bits set if not supported).
	uInt16	padding[8];			//	Zero filled.
	uInt16	check_sum;			//	Check sum of entire EEPROM except these two bytes.  (location is NOT dependant on EEPROM size).
	uInt16	a_ranges_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	a_ranges_d_50;		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets_d_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges_d_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets_d_50;		//	Default calibration values (all bits set if not supported).

	uInt8	TAO_Dual[16];		//  Trigger addres offset for dual mode
	uInt8	TAO_Single[16];     //  Trigger addres offset for single mode
	uInt16  delay_lines[8];     //  Delay lines values to fine tune channel sync

	uInt16	padding_4096[40];	//	Zero filled.
	uInt8	eib_dac_area[192];	//	0x80 filled.

#ifdef __linux__
}__attribute__ ((packed)) eepromtype4096;

#else
}eepromtype4096;
#endif

//----------------------------------------------------------

typedef struct
{
	char	signature[4];		//	NOT null terminated.
	uInt16	size;				//	Size of EEPROM in BITS.
	uInt16	board_type;			//	Encoded board types from GAGE_DRV.H.
	uInt16	version;			//	BCD, XX.XX.
	uInt16	memory_size;		//	Decimal (in kilobytes).
	uInt32	serial_number;		//	BCD, right-justified w/leading zeros.
	uInt32	options;			//	BIT encoded (see EEPROM_OPTIONS_XXXXXXXX).
	uInt16	a_ranges[7];		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets[7];		//	Default calibration values (all bits set if not supported).
	uInt16	power_on_value;		//	Time in 0.1 mSecs for power on delay.
	uInt16	hw_ati_version;		//	BCD, XX.XX.
	uInt16	hw_mem_version;		//	BCD, XX.XX.
	uInt16	hw_ets_version;		//	BCD, XX.XX.
	uInt16	ets_offset;			//	Decimal.
	uInt16	ets_correct;		//	Decimal.
	uInt16	ets_trigger_offset;	//	Decimal.
	uInt8	trig_level_off[2];	//	Decimal.
	uInt8	trig_level_scale[2];//	Decimal.
	uInt16	trig_addr_off[4];	//	uInt4, 16 values in 4 words (layed out linearly -> 0,1,2,3 4,5,6,7 8,9,10,11 12,13,14,15) or
								//	uInt8,  8 values in 4 words (layed out linearly -> 0,1 2,3 4,5 6,7).
	uInt16	a_ranges_50;		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets_50;		//	Default calibration values (all bits set if not supported).
	uInt16	padding[8];			//	Zero filled.
	uInt16	check_sum;			//	Check sum of entire EEPROM except these two bytes.  (location is NOT dependant on EEPROM size).
	uInt16	a_ranges_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets_d[7];		//	Default calibration values (all bits set if not supported).
	uInt16	a_ranges_d_50;		//	Default calibration values (all bits set if not supported).
	uInt16	a_offsets_d_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_ranges_d_50;		//	Default calibration values (all bits set if not supported).
	uInt16	b_offsets_d_50;		//	Default calibration values (all bits set if not supported).

	uInt8	TAO_Dual[16];		//  Trigger addres offset for dual mode
	uInt8	TAO_Single[16];     //  Trigger addres offset for single mode
	uInt16  delay_lines[8];     //  Delay lines values to fine tune channel sync

	uInt16	padding_4096[40];	//	Zero filled.
	uInt8	eib_dac_area[192];	//	0x80 filled.

	uInt16	padding_16384[468];	//	Zero filled.

	uInt16	cal_OneG_DC[96];
	uInt16	cal_ext_trig_addr[24];	//	0x80 filled.
	uInt16	cal_trig_level[24];	//	0x80 filled.
	uInt16	cal_trig_addr[12];	//	0x7F filled.

	uInt16 cal_ClkTable [24]; //	0x80 filled.
	uInt16 cal_DmuxTable [24];//	0x64 filled.
	uInt16 cal_GainTable [32];//	0x80 filled.
	uInt16 cal_PositionTable [32];//	0x80 filled.
	uInt16 cal_OffsetTable [32]; 	//	0x80 filled.
#ifdef __linux__
}__attribute__ ((packed)) eepromtype16384;
#else

}eepromtype16384;
#endif

//----------------------------------------------------------

typedef union  {

	eepromtype1024	_1024;
	eepromtype4096	_4096;
	eepromtype16384	_16384;

} CP500_EEPROMSTRUCT;

//! \struct _CP500_EEPROM_RW_STRUCT
//! \brief Structure used in CsDrvSet() and CsDrvGet() for Cs12xx, Cs14xx, Cs16xx and Cs82G
//!

typedef struct _CP500_EEPROM_RW_STRUCT
{
	uInt32	u32Size;				// Size of this structure
	uInt16	u16Bits;
	CP500_EEPROMSTRUCT	Eeprom;		// Eeprom structure shared by Cs12xx, Cs14xx, Cs16xx and Cs82G
} CP500_EEPROM_RW_STRUCT, *PCP500_EEPROM_RW_STRUCT;

typedef struct _CS_DELAYLINE_STRUCT
{
	uInt32	u32Size;			// Size of this structure
	uInt8	u8CardNumber;
	uInt16	u16aDelLines[24];	// should be the same size as NB_DELAY_LINES_TABLE * DELAY_LINES_TABLE_SIZE
								// (gage_low.h)
}CS_DELAYLINE_STRUCT, *PCS_DELAYLINE_STRUCT;


//
